Revit 2024 API
CellType Enumeration
 Declares the cell data type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public enum CellType
Visual Basic
Public Enumeration CellType
Visual C++
public enum class CellType
Members
Member name | Description
Text |  Simple text
Graphic |  Embedded graphic
Parameter |  Data bound parameter
Inherited |  the type is inherited from the column or section if appropriate
CombinedParameter |  The type is combined parameter
CalculatedValue |  The type is a calculated value
ParameterText |  Read only parameter which only show formatted string
CustomField |  Data bounded to a Schedule Custom Field.
See Also
Autodesk.Revit.DB Namespace